#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-2-tier-webapp/runs/run-GKcPoYud4sUgjmKX

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
tls_private_key.main: Refreshing state... [id=5aba805d9992a3651f994795885f0eff3777a1ee]
module.alb.random_id.suffix: Refreshing state... [id=nDdyZA]
local_file.private_key: Refreshing state... [id=d40be34d1d278418459eb63be9e9971757b9ea5b]
module.alb.aws_s3_bucket_public_access_block.alb_logs_public_access_block: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.ec2.data.aws_ami.latest_amazon_linux: Reading...
module.alb.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.ec2.aws_cloudwatch_log_group.app_log_group: Refreshing state... [id=/aws/ec2/webapp-logs]
module.alb.aws_s3_bucket_policy.alb_log_policy: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.alb.aws_s3_bucket_versioning.alb_logs_versioning: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.vpc.aws_cloudwatch_log_group.flow_log_group: Refreshing state... [id=/aws/vpc/flow-logs-debug]
module.vpc.aws_iam_role.flow_log_role: Refreshing state... [id=vpc-flow-log-role]
module.alb.aws_s3_bucket_lifecycle_configuration.log_lifecycle: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.alb.aws_s3_bucket.alb_logs: Refreshing state... [id=my-alb-debug-logs-9c377264]
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-05da4a2b7804164bf]
module.ec2.aws_iam_role.ec2_cloudwatch_role: Refreshing state... [id=ec2-cloudwatch-role]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=871308866502]
module.storage.data.aws_elb_service_account.main: Reading...
module.storage.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
aws_key_pair.generated_key: Refreshing state... [id=project-key]
module.ec2.aws_ssm_parameter.cw_agent_config: Refreshing state... [id=AmazonCloudWatch-linux-webapp]
module.vpc.aws_iam_role_policy.flow_log_policy: Refreshing state... [id=vpc-flow-log-role:vpc-flow-log-policy]
module.ec2.aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=ec2-cloudwatch-role-20260212103025707000000002]
module.ec2.aws_iam_role_policy_attachment.cw_policy: Refreshing state... [id=ec2-cloudwatch-role-20260212103025648600000001]
module.ec2.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-cloudwatch-profile]
module.ec2.data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-02b86da1e539b4dd0]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-07a3299ed0aae20a6]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-00e9bdf70a109b206]
module.vpc.aws_flow_log.vpc_debug_logs: Refreshing state... [id=fl-00c7cb7a045faf6d5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d4d8a7017ed5699b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-083cc1291ca50f581]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d8b001141040ba95]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-018d10bc366dacbaf]
module.security_groups.aws_security_group.alb_sg: Refreshing state... [id=sg-06e12d2afdcf825e0]
module.alb.aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:targetgroup/app-tg20260212103037104700000004/c3aa358cc788991c]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-08b33045c070e376c]
module.security_groups.aws_security_group.ec2_sg: Refreshing state... [id=sg-08ff505d4398bf347]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=main-rds-subnet-group]
module.alb.aws_lb.application_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:loadbalancer/app/webapp-2-tier-alb/6be9d6b8e9d3dbb4]
module.vpc.aws_route_table_association.public_assoc[1]: Refreshing state... [id=rtbassoc-05c5424fdc7d49022]
module.vpc.aws_route_table_association.public_assoc[0]: Refreshing state... [id=rtbassoc-01f4d43508f097aa7]
module.security_groups.aws_security_group.rds_sg: Refreshing state... [id=sg-064570d1e4b216720]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:listener/app/webapp-2-tier-alb/6be9d6b8e9d3dbb4/d754b738d2e4a1a7]
module.rds.aws_db_instance.mysql: Refreshing state... [id=db-KAFTB54W4WY5GRLEUAENAUSPSA]
module.ec2.aws_launch_template.app_lt: Refreshing state... [id=lt-059c3bf492a0818fd]
module.ec2.aws_autoscaling_group.app_asg: Refreshing state... [id=webapp-asg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./project-key.pem"
      + id                   = (known after apply)
    }

  # module.alb.aws_lb.application_lb will be updated in-place
  ~ resource "aws_lb" "application_lb" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-1:871308866502:loadbalancer/app/webapp-2-tier-alb/6be9d6b8e9d3dbb4"
        name                                                         = "webapp-2-tier-alb"
        tags                                                         = {
            "Name" = "webapp-2-tier-alb"
        }
        # (27 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = "my-alb-debug-logs-9c377264" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.alb.aws_s3_bucket.alb_logs will be destroyed
  # (because aws_s3_bucket.alb_logs is not in configuration)
  - resource "aws_s3_bucket" "alb_logs" {
      - arn                         = "arn:aws:s3:::my-alb-debug-logs-9c377264" -> null
      - bucket                      = "my-alb-debug-logs-9c377264" -> null
      - bucket_domain_name          = "my-alb-debug-logs-9c377264.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "my-alb-debug-logs-9c377264.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "my-alb-debug-logs-9c377264" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::127311923021:root"
                        }
                      - Resource  = "arn:aws:s3:::my-alb-debug-logs-9c377264/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "CostCenter"  = "Cloud-Learning"
          - "Environment" = "Development"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "ShenLoong"
          - "Project"     = "Project-5-Two-Tier-WebApp"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "74d13fa2e70e29cfaafe00b1c1d0169937308220ffeb3874b58e1e9190a4ca4d" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 7 -> null
          - enabled                                = true -> null
          - id                                     = "delete-old-logs" -> null
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          - expiration {
              - days                         = 14 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.alb.aws_s3_bucket_lifecycle_configuration.log_lifecycle will be destroyed
  # (because aws_s3_bucket_lifecycle_configuration.log_lifecycle is not in configuration)
  - resource "aws_s3_bucket_lifecycle_configuration" "log_lifecycle" {
      - bucket                                 = "my-alb-debug-logs-9c377264" -> null
      - id                                     = "my-alb-debug-logs-9c377264" -> null
      - transition_default_minimum_object_size = "all_storage_classes_128K" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - id     = "delete-old-logs" -> null
          - status = "Enabled" -> null
            # (1 unchanged attribute hidden)

          - abort_incomplete_multipart_upload {
              - days_after_initiation = 7 -> null
            }

          - expiration {
              - days                         = 14 -> null
              - expired_object_delete_marker = false -> null
            }

          - filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.alb.aws_s3_bucket_policy.alb_log_policy will be destroyed
  # (because aws_s3_bucket_policy.alb_log_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "alb_log_policy" {
      - bucket = "my-alb-debug-logs-9c377264" -> null
      - id     = "my-alb-debug-logs-9c377264" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::127311923021:root"
                        }
                      - Resource  = "arn:aws:s3:::my-alb-debug-logs-9c377264/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.alb.aws_s3_bucket_public_access_block.alb_logs_public_access_block will be destroyed
  # (because aws_s3_bucket_public_access_block.alb_logs_public_access_block is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "alb_logs_public_access_block" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "my-alb-debug-logs-9c377264" -> null
      - id                      = "my-alb-debug-logs-9c377264" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.alb.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "alb_logs_encryption" {
      - bucket                = "my-alb-debug-logs-9c377264" -> null
      - id                    = "my-alb-debug-logs-9c377264" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.alb.aws_s3_bucket_versioning.alb_logs_versioning will be destroyed
  # (because aws_s3_bucket_versioning.alb_logs_versioning is not in configuration)
  - resource "aws_s3_bucket_versioning" "alb_logs_versioning" {
      - bucket                = "my-alb-debug-logs-9c377264" -> null
      - id                    = "my-alb-debug-logs-9c377264" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.alb.random_id.suffix will be destroyed
  # (because random_id.suffix is not in configuration)
  - resource "random_id" "suffix" {
      - b64_std     = "nDdyZA==" -> null
      - b64_url     = "nDdyZA" -> null
      - byte_length = 4 -> null
      - dec         = "2620879460" -> null
      - hex         = "9c377264" -> null
      - id          = "nDdyZA" -> null
    }

  # module.ec2.data.aws_instances.asg_instances will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_instances" "asg_instances" {
      + id                   = (known after apply)
      + ids                  = (known after apply)
      + instance_state_names = [
          + "running",
        ]
      + instance_tags        = (known after apply)
      + ipv6_addresses       = (known after apply)
      + private_ips          = (known after apply)
      + public_ips           = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ASG-Web-Server",
            ]
        }
    }

  # module.ec2.aws_autoscaling_group.app_asg will be updated in-place
  ~ resource "aws_autoscaling_group" "app_asg" {
        id                               = "webapp-asg"
        name                             = "webapp-asg"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-059c3bf492a0818fd"
            name    = "webapp-launch-template-20260212103831922200000007"
          ~ version = "1" -> (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.ec2.aws_launch_template.app_lt will be updated in-place
  ~ resource "aws_launch_template" "app_lt" {
        id                                   = "lt-059c3bf492a0818fd"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "webapp-launch-template-20260212103831922200000007"
        tags                                 = {}
      ~ user_data                            = (sensitive value)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.storage.aws_s3_bucket.alb_logs will be created
  + resource "aws_s3_bucket" "alb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCenter"  = "Cloud-Learning"
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "Project-5-Two-Tier-WebApp"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_lifecycle_configuration.log_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "log_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete-old-logs"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 14
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_policy.alb_log_policy will be created
  + resource "aws_s3_bucket_policy" "alb_log_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.storage.aws_s3_bucket_public_access_block.alb_logs_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "alb_logs_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.storage.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "alb_logs_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_versioning.alb_logs_versioning will be created
  + resource "aws_s3_bucket_versioning" "alb_logs_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.storage.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 8 to add, 3 to change, 7 to destroy.

Changes to Outputs:
  ~ ec2_instance_ids     = [] -> (known after apply)
  ~ ec2_public_ips       = [] -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 9 estimated
           $34.4888000000000016/mo +$0.0

```

</details>